insert into masters(name)
values ('Oleg'),
       ('Pavel'),
       ('Erdem'),
       ('Alexander'),
       ('Zhora'),
       ('Ashot'),
       ('Ibragim'),
       ('Islam');

INSERT INTO cars (num, color, mark, is_foreign)
VALUES ('061', 'Red', 'Toyota', false),
       ('702', 'Blue', 'Honda', false),
       ('123', 'Green', 'Ford', false),
       ('344', 'Silver', 'Chevrolet', false),
       ('565', 'Black', 'Nissan', false),
       ('986', 'White', 'Volkswagen', true),
       ('127', 'Gray', 'BMW', true),
       ('098', 'Yellow', 'Mercedes-Benz', true),
       ('922', 'Orange', 'Audi', true),
       ('666', 'Purple', 'Lamborghini', true),
       ('777', 'Brown', 'Porsche', true),
       ('112', 'Pink', 'Ferrari', true),
       ('228', 'Cyan', 'Maserati', true),
       ('148', 'Magenta', 'Tesla', true),
       ('678', 'Lime', 'Kia', false),
       ('223', 'Turquoise', 'Subaru', false),
       ('417', 'Beige', 'Hyundai', false),
       ('621', 'Gold', 'Lexus', true),
       ('719', 'Silver', 'Jeep', true),
       ('520', 'Bronze', 'Cadillac', true);

INSERT INTO services (name, cost_our, cost_foreign)
VALUES
    ('Замена масла', 2000, 3000),
    ('Регулировка двигателя', 1500, 2500),
    ('Замена тормозных колодок', 1200, 1800),
    ('Ремонт трансмиссии', 3000, 4500),
    ('Замена фильтра воздуха', 800, 1200),
    ('Диагностика двигателя', 1000, 1500),
    ('Замена свечей зажигания', 500, 800),
    ('Замена аккумулятора', 1200, 2000),
    ('Ремонт сцепления', 2500, 3500),
    ('Замена рулевой рейки', 1800, 2800),
    ('Выравнивание колес', 600, 1000),
    ('Замена генератора', 1400, 2200),
    ('Ремонт электрики', 900, 1400),
    ('Замена стартера', 700, 1200),
    ('Замена амортизаторов', 1600, 2600),
    ('Ремонт топливной системы', 1100, 1800),
    ('Замена рулевой тяги', 800, 1400),
    ('Регулировка подвески', 900, 1500),
    ('Замена глушителя', 1200, 1900),
    ('Ремонт системы охлаждения', 1400, 2200);


INSERT INTO works (date_work, master_id, car_id, service_id)
VALUES
    ('2023-01-15', 1, 3, 5),
    ('2023-02-23', 2, 2, 4),
    ('2023-03-10', 3, 6, 7),
    ('2023-04-07', 4, 8, 2),
    ('2023-05-18', 5, 1, 6),
    ('2023-06-29', 6, 4, 8),
    ('2023-07-11', 7, 7, 1),
    ('2023-08-05', 8, 5, 3),
    ('2023-09-20', 1, 2, 7),
    ('2023-10-14', 2, 3, 4),
    ('2023-11-03', 3, 11, 15),
    ('2023-12-29', 4, 12, 18),
    ('2023-02-08', 5, 9, 11),
    ('2023-03-22', 6, 15, 19),
    ('2023-05-07', 7, 16, 12),
    ('2023-06-16', 8, 17, 14),
    ('2023-08-02', 1, 10, 17),
    ('2023-09-12', 2, 14, 10),
    ('2023-10-28', 3, 18, 13),
    ('2023-12-09', 4, 20, 16);


